; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	instrument7 - instrument
	spectrograph3 - mode
	thermograph4 - mode
	thermograph1 - mode
	thermograph0 - mode
	thermograph2 - mode
	image5 - mode
	GroundStation2 - direction
	GroundStation5 - direction
	GroundStation0 - direction
	Star4 - direction
	Star1 - direction
	GroundStation3 - direction
	Star6 - direction
	Star7 - direction
	Planet8 - direction
	Phenomenon9 - direction
	Planet10 - direction
	Phenomenon11 - direction
	Star12 - direction
)
(:init
	(supports instrument0 thermograph4)
	(supports instrument0 thermograph2)
	(calibration_target instrument0 GroundStation3)
	(calibration_target instrument0 GroundStation5)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet10)
	(supports instrument1 thermograph0)
	(supports instrument1 spectrograph3)
	(calibration_target instrument1 Star1)
	(calibration_target instrument1 Star4)
	(supports instrument2 thermograph4)
	(supports instrument2 thermograph0)
	(supports instrument2 spectrograph3)
	(calibration_target instrument2 GroundStation0)
	(calibration_target instrument2 Star4)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation0)
	(supports instrument3 spectrograph3)
	(supports instrument3 image5)
	(supports instrument3 thermograph1)
	(calibration_target instrument3 GroundStation5)
	(supports instrument4 thermograph0)
	(supports instrument4 spectrograph3)
	(calibration_target instrument4 Star4)
	(supports instrument5 thermograph0)
	(calibration_target instrument5 GroundStation0)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon9)
	(supports instrument6 thermograph2)
	(calibration_target instrument6 Star4)
	(calibration_target instrument6 Star1)
	(supports instrument7 image5)
	(calibration_target instrument7 GroundStation3)
	(calibration_target instrument7 Star1)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation5)
)
(:goal (and
	(pointing satellite0 Planet8)
	(have_image Star6 thermograph4)
	(have_image Star6 thermograph1)
	(have_image Star7 thermograph2)
	(have_image Planet8 thermograph1)
	(have_image Planet8 thermograph2)
	(have_image Phenomenon9 thermograph1)
	(have_image Phenomenon9 spectrograph3)
	(have_image Planet10 thermograph4)
	(have_image Phenomenon11 thermograph4)
	(have_image Star12 thermograph4)
	(have_image Star12 thermograph1)
))

)

; plan
1. (turn_to satellite2 groundstation5 phenomenon9)
   deleted: (pointing satellite2 phenomenon9)
   added: (pointing satellite2 groundstation5)
   goals met: 0 of 12
2. (switch_on instrument3 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument3)
   goals met: 0 of 12
3. (calibrate satellite2 instrument3 groundstation5)
   added: (calibrated instrument3)
   goals met: 0 of 12
4. (turn_to satellite2 planet8 groundstation5)
   deleted: (pointing satellite2 groundstation5)
   added: (pointing satellite2 planet8)
   goals met: 0 of 12
5. (take_image satellite2 planet8 instrument3 thermograph1)
   added: (have_image planet8 thermograph1)
   goals met: 1 of 12
6. (turn_to satellite2 phenomenon9 planet8)
   deleted: (pointing satellite2 planet8)
   added: (pointing satellite2 phenomenon9)
   goals met: 1 of 12
7. (turn_to satellite0 groundstation3 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 groundstation3)
   goals met: 1 of 12
8. (take_image satellite2 phenomenon9 instrument3 spectrograph3)
   added: (have_image phenomenon9 spectrograph3)
   goals met: 2 of 12
9. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 2 of 12
10. (calibrate satellite0 instrument0 groundstation3)
   added: (calibrated instrument0)
   goals met: 2 of 12
11. (take_image satellite2 phenomenon9 instrument3 thermograph1)
   added: (have_image phenomenon9 thermograph1)
   goals met: 3 of 12
12. (turn_to satellite0 phenomenon11 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 phenomenon11)
   goals met: 3 of 12
13. (take_image satellite0 phenomenon11 instrument0 thermograph4)
   added: (have_image phenomenon11 thermograph4)
   goals met: 4 of 12
14. (turn_to satellite0 planet10 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 planet10)
   goals met: 4 of 12
15. (take_image satellite0 planet10 instrument0 thermograph4)
   added: (have_image planet10 thermograph4)
   goals met: 5 of 12
16. (turn_to satellite0 star12 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 star12)
   goals met: 5 of 12
17. (take_image satellite0 star12 instrument0 thermograph4)
   added: (have_image star12 thermograph4)
   goals met: 6 of 12
18. (turn_to satellite0 star6 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 star6)
   goals met: 6 of 12
19. (take_image satellite0 star6 instrument0 thermograph4)
   added: (have_image star6 thermograph4)
   goals met: 7 of 12
20. (turn_to satellite0 star7 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 star7)
   goals met: 7 of 12
21. (take_image satellite0 star7 instrument0 thermograph2)
   added: (have_image star7 thermograph2)
   goals met: 8 of 12
22. (turn_to satellite0 planet8 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 planet8)
   goals met: 9 of 12
23. (take_image satellite0 planet8 instrument0 thermograph2)
   added: (have_image planet8 thermograph2)
   goals met: 10 of 12
24. (turn_to satellite2 star12 phenomenon9)
   deleted: (pointing satellite2 phenomenon9)
   added: (pointing satellite2 star12)
   goals met: 10 of 12
25. (take_image satellite2 star12 instrument3 thermograph1)
   added: (have_image star12 thermograph1)
   goals met: 11 of 12
26. (turn_to satellite2 star6 star12)
   deleted: (pointing satellite2 star12)
   added: (pointing satellite2 star6)
   goals met: 11 of 12
27. (take_image satellite2 star6 instrument3 thermograph1)
   added: (have_image star6 thermograph1)
   goals met: 12 of 12
